{
    "Employer": [
        {
            "Name": "Geek Squad",
            "StartDate": "2015",
            "EndDate": "2015",
            "Projects": [
                {
                    "Title": "DATABASE AND SSIS JOB SEARCH",
                    "Description": "I have written and deployed a software application for tracking statistics at our Geek Squad precinct. It managed the employees, positions, and services that we had at our Geek Squad precinct. It allowed our manager to import corporate budget reports into the database and export reports for employee’s individual sales or the sales for a particular day, week, or month. I used SQL Server as the DBMS and included a database creation script with the source code.",
                    "Tags": [
                        "C#",
                        ".NET Framework",
                        "WinForms"
                    ]
                }
            ]
        },
        {
            "Name": "West Corporation",
            "StartDate": "05/19/2015",
            "EndDate": "10/04/2017",
            "Projects": [
                {
                    "Title": "DATABASE AND SSIS JOB SEARCH",
                    "Description": "Database Search had a searchable list of the databases on all West’s servers, what version of CRM they were on, and whether it was a development, test, or production database. The SSIS job search tool would query West’s servers that hosted SQL Server Agent Jobs and let the user search for jobs and see what their run schedules were.",
                    "Tags": [
                        "C#",
                        ".NET Framework",
                        "WinForms"
                    ]
                },
                {
                    "Title": "ONCONTACT QUICK LAUNCH",
                    "Description": "I added functionality to one of the tools that was previously created by my supervisor, at the time. It automated the process of clearing local caches and dynamically updating configuration files that the software needed to access client databases. I also added the Database Search functionality to the quick launch so that you could find where the programs were located while loading up the applications.",
                    "Tags": [
                        "C#",
                        ".NET Framework",
                        "WinForms"
                    ]
                },
                {
                    "Title": "WEST IT PORTAL",
                    "Description": "I created an ASP.NET MVC website that centralizes all the sites and tools our IT department needs to access on a daily basis. I created a web version of my previous database searching and SSIS job searching tools using ASP.NET MVC, JavaScript, jQuery, and Bootstrap. I also recreated one of our work request systems in the website, so that we didn't have to leave the 'IT Portal' for anything.",
                    "Tags": [
                        "C#",
                        "ASP.NET",
                        "WPF"
                    ]
                }
            ]
        },
        {
            "Name": "J.J. Keller",
            "StartDate": "10/01/2017",
            "EndDate": "03/01/2018",
            "Projects": []
        },
        {
            "Name": "Mile of Music",
            "StartDate": "03/01/2018",
            "EndDate": "08/01/2018",
            "Projects": []
        },
        {
            "Name": "Renaissance Learning",
            "StartDate": "04/01/2018",
            "EndDate": "07/01/2018",
            "Projects": []
        },
        {
            "Name": "Network Health",
            "StartDate": "08/01/2018",
            "EndDate": "10/01/2018",
            "Projects": []
        },
        {
            "Name": "ClearTREND",
            "StartDate": "10/01/2018",
            "EndDate": "11/01/2018",
            "Projects": []
        },
        {
            "Name": "Express Scripts",
            "StartDate": "11/01/2018",
            "EndDate": "",
            "Projects": []
        }
    ]
}